// 04.09.23 (заменить синтаксис во всех компонентах как в компоненте product.)
// 04.09.23 (нужно, чтобы заработала корзина целиком и полностью)
// 07.09.23 (заменить все ключи у v-for с index на подходящие.) (Подключить страницу регистрации), (записываем в localstorage). (+ доделать totalprice in cart.)
// 07.09.23 пробежаться по коду, чтобы выглядел хорошо
// 11.09.23 (поправить sign-in) + (убрать v в компонентах) + (убрать pasp) + (создать функцию, которая будет свитчить значение isActive) + (добавить предупреждение о неправильных данных)
// 11.09.23 (ключ в local user,) (а в значение у нас массив из данных юзеров), в случае успешной валидации должно пробрасывать на страницу ресторана
// 11.09.23 (+ страницу оформления заказа.)
// 14.09.23 (убрать скрол у информации продуктов.) (допилить страницу оформления заказа) + фичи внутри нее. навести порядок во всем коде. wrapper это обложка и используется в 1 dive
// 14.09.23 посмотреть про ts + составить план,как будем вносить его в наш проект.
// Проверить весь проект с помощью TS.